using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ZOO
{
    class Program
    {
//        1. За допомогю мехінізмів наслідування та поліморфізму реалізувати
//ієрархію наслідування наступних “створінь”:
//a) Створіння - абстрактний базовий клас
//b) Тварина - клас який реалізовує базовий функціонал, та дозволяє
//перевизначити свої методи класам-нащадкам за допомогою
//віртуальних методів
//c) Класи Рептилія, Савець, Пташка, Риба - класи нащадки, що
//реалізують повну функціональність вказаного типу тварини
//d) Класи Ведмідь, Жаба, Дельфін, Карп, Орел - класи нащадки,
//остаточні в дереві наслідування
//e) Інтерфейси Літаючий, Бігаючий, Плаваюйчий, Повзаючий -
//розширюють функціональність тварин, наділяючи їх певними
//здатностями
//2. Створити “зоопарк” куди помістити не менше одного екземпляру
//кожного з дочірніх класів
//3. Провести перекличку по “зоопарку” перевіривши повну
//функціональність кожної з присутньої тварини
//4. При кожному етапі наслідування, клас нащадок розширює
//функціональність батьківського клас не менш ніж на 2
//властивості/метода або перевизначать такі з батьківського класа
        static void Main(string[] args)
        {
        }
    }
}
