using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ClassFactory
{
    class Program
    {
        /*
         Описати за допомогою класів структуру підприємства 
        1. Class Factory - модифікувати і перетворити на partial class. 
        2. Описання полів та оголошеня масиву Департаментів зробити в 1й частині (в першому файлі),
         оголошення масиву Products[] та оголошення і реалізацію методу string ReturnString() в 2му. 
         3. Створти 4 partial метода: a)void SetAvgSalary - встановлення для відповідного приватного поля середньої 
         ЗП по підприємству b) void SetTotalSalary - встановлення для відповідного приватного поля сумарної ЗП
         на 1го працівника - сума вартості всіх товарів / на кількість працівників d)Void SetEmpCount - встановлення для відповідного поля загальної кількості працюючих
        5.Оголошення часткових методів зробити в 1й частині, а реалізацію виконати в 2частині класу (в іншому файлі) 6.Зміна структури класу Фабрика не повинна вплинути на описи інших класів 
        7.Змінити поле “Ім”я “ для департаменту на readonly, яке повинне ініціалізуватися у параметризованому конструкторі заданим строковим параметром. 8.Класи розмежовуюься окремими файлами.
                     */
        static void Main(string[] args)
        {
            Factory factory = new Factory();
            Console.WriteLine(factory.ReturnString());

        }
    }
}
